xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
					case XI_FILE_CHUNK:

					        /* Parse the FILE_CHUNK message and send another
					         * FILE_GET_CHUNK request if we're still downloading data */
					        xi_process_file_chunk( in_context_handle, cb );

					        /* Free the incoming cbor message context */
							cn_cbor_free(cb CBOR_CONTEXT_PARAM);

							/* Since we're getting file chunks then we were in a downloading state.
							 * If we're not currently downloading, that means the download finished
							 * or encountered an error. */
							if( ! downloading )
							{
                                sprintf( file_current_revision, "%s", download_context.file_revision );

                                printf( "=================\n");
                                printf( "Done downloading.\n");
                                printf( "   result: %d\n", download_context.result );
                                printf( "=================\n");

                                /* Log the download complete information
                                 *   TODO: report download_context.result value to the logging service */
                                snprintf( message,sizeof(message),"File download complete" );
                                snprintf( details,sizeof(details),"name=%s revision=%s length = %d",filename, file_current_revision, download_context.file_length );
                                snprintf( buffer,sizeof(buffer),"{\"message\":\"%s\",\"severity\":\"notice\",\"details\":\"%s\"}",message,details );
                                xi_publish( in_context_handle, xi_logtopic, buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );

                                /* Finalize SHA256 Digest */
                                sha256_final( &download_context.sha256_context, download_context.file_local_computed_fingerprint );
                                printf( "Calculated hash = 0x" );
                                print_hash( download_context.file_local_computed_fingerprint );

                                /* Close the firmware file */
                                int result = 0;
                                result = sl_extlib_FlcCloseFile( download_context.file_handle, NULL, NULL, 0 );
                                printf("*** Close File Result: %d\n", result);

                                /* Set the bootloader to test the new image */
                                if( download_context.result || result )
                                {
                                    printf("NOT MARKING FILE TO TEST DUE TO ERRORS\n");
                                }
                                else
                                {
                                    result = sl_extlib_FlcTest( FLC_TEST_RESET_MCU | FLC_TEST_RESET_MCU_WITH_APP );
                                    printf("*** FLC Test Result: %d, rebooting\n", result);

                                    /* Reboot the device to test the image */
                                    RebootMCU();
                                }

                            }
                            break;
                        default:
                            break;
                    }
                }

            }
            return;
        default:
            return;
    }
}

void
xi_publish_file_info( xi_context_handle_t in_context_handle )
{
    unsigned char encoded[128];
    ssize_t enc_sz;

    /* Let's try making a XI_FILE_INFO packet */
    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create( &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgtype", &err ),
                     cn_cbor_int_create( XI_FILE_INFO, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create("msgver", &err ),
                     cn_cbor_int_create( 1, &err ), &err );

    cn_cbor *a = cn_cbor_array_create( &err );
    cn_cbor *cb_file1 = cn_cbor_map_create( &err );
    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "N", &err ),
                     cn_cbor_string_create( filename, &err ), &err );

    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( "-1", &err ), &err );

    cn_cbor_array_append( a, cb_file1, &err );
    cn_cbor_map_put( cb_map, cn_cbor_string_create( "list", &err ),
                     a, &err );

    enc_sz = cn_cbor_encoder_write( encoded, 0, sizeof( encoded ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    if( 0 >= enc_sz )
    {
        /* TODO: Log error to Device Logs. */
    }

    /* publish the FILE_INFO message */
    xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz, XI_MQTT_QOS_AT_MOST_ONCE,
                     XI_MQTT_RETAIN_FALSE, NULL, NULL );
    printf( "Published FILE_INFO to %s\n",xi_stopic );

    /* Send Status to Device Logs */
    /* TODO: Should we really do this ? */
    snprintf( message,sizeof(message),"File info" );
    snprintf( details,sizeof(details), "name=%s revision=%s", filename, file_current_revision );
    snprintf( buffer,sizeof(buffer),"{\"message\":\"%s\",\"severity\":\"notice\",\"details\":\"%s\"}",message,details );
    xi_publish( in_context_handle, xi_logtopic, buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );

    /* TODO: Should we really do this? */
    sl_extlib_FlcCloseFile(download_context.file_token, NULL, NULL, 0);
}


void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor *cb)
{
    cn_cbor *cb_list;
    cn_cbor *cb_item;
    cn_cbor *cb_file;
    int filelistlength = 0;
    int i,index;

    /* Set Download State to Active */
    downloading = 1;

    /* Zero out download_context */
    memset( &download_context, 0, sizeof( file_download_ctx_t ) );

    /* Initialize sha256 digest of the file and tracking variables */
    sha256_init( &download_context.sha256_context );

    cb_item = cn_cbor_mapget_string(cb, "msgver");
    if(cb_item) {
        printf("FILE_UPDATE_AVAILABLE: msgver = %d\n",cb_item->v.uint);
        if(1 != cb_item->v.uint) return;
    }
    cb_list = cn_cbor_mapget_string(cb, "list");
    if(cb_list) {
        filelistlength = cb_list->length;
        printf("FILE_UPDATE_AVAILABLE: list length = %d\n",filelistlength);
    }

