xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    for(index=0;index<filelistlength;index++) {
        cb_item = cn_cbor_index(cb_list, index);

        if(cb_item)
        {
        	    // File 'N'ame
            cb_file = cn_cbor_mapget_string(cb_item, "N");
            if( cb_file )
            {
                strncpy( incomingFilename,cb_file->v.str, MAX_INCOMING_FILENAME_LENGTH );

                if( (unsigned int) cb_file->length < MAX_INCOMING_FILENAME_LENGTH )
                {
                    incomingFilename[cb_file->length] = '\0';
                }

                incomingFilename[MAX_INCOMING_FILENAME_LENGTH-1] = '\0';
            }
            else
            {
                printf("No key called N\n");
            }

            // File 'R'evision
            cb_file = cn_cbor_mapget_string(cb_item, "R");
            if( cb_file )
            {
                strncpy( download_context.file_revision, cb_file->v.str, sizeof( download_context.file_revision ) );

                if( (unsigned int) cb_file->length < sizeof( download_context.file_revision ) )
                {
                    download_context.file_revision[cb_file->length] = '\0';
                }

                download_context.file_revision[sizeof(download_context.file_revision)-1] = '\0';
            }
            else
            {
                printf("No key called R\n");
            }

            // File 'S'ize
            cb_file = cn_cbor_mapget_string(cb_item, "S");
            if(cb_file)
            {
                printf( "FILE_UPDATE_AVAILABLE: file length = %d\n",cb_file->v.sint );
                download_context.file_length = cb_file->v.sint;
                tenpercent = download_context.file_length / 10;
                currenttenpercent = tenpercent;
                printf("Filelength %d\n",download_context.file_length);
            }
            else
            {
                printf("No key called S\n");
            }

            // File 'F'ingerprint
            cb_file = cn_cbor_mapget_string(cb_item, "F");
            if(cb_file)
            {
                for(i=0;i<32;i++)
                {
                    download_context.file_sft_fingerprint[i] = cb_file->v.str[i];
                }

                printf("FILE_UPDATE_AVAILABLE: file fingerprint = 0x");
                for(i=0;i<32;i++)
                {
                    printf("%02x",download_context.file_sft_fingerprint[i] );
                }
                printf("\n");
            }
            else
            {
                printf("No key called F\n");
            }

        } else {
            printf("No item at index %d\n",i);
        }
    }
    printf( "\n" );
    printf( "xi_parse_file_update_available { name: \"%s\", revision: \"%s\"}\n", incomingFilename, download_context.file_revision );
    printf( "\n" );


    /* Fetch the initial chunk of the file */
    xi_publish_file_chunk_request( in_context_handle, incomingFilename, download_context.file_revision,
                                   download_context.file_storage_offset );
}

int xi_parse_file_chunk( cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk )
{
    if( NULL == in_cb || NULL == out_sft_file_chunk )
    {
        return -1;
    }

    static int ledToggle = 0;
    ledToggle = ( ledToggle + 1 ) % 2;
    if( ledToggle )
    {
        GPIO_IF_LedOn( MCU_RED_LED_GPIO );
    }
    else
    {
        GPIO_IF_LedOff( MCU_RED_LED_GPIO );
    }

    cn_cbor *cb_item = NULL;
    memset( out_sft_file_chunk, 0, sizeof(xi_sft_file_chunk_t) );

    //
    // msg version
    //
    cb_item = cn_cbor_mapget_string( in_cb, "msgver" );
    if(cb_item)
    {
        if( 1 != cb_item->v.uint )
        {
            printf( "FILE_CHUNK unsupported message version: %d\n", cb_item->v.uint );
            return -1;
        }
    }
    else
    {
       printf( "FILE_CHUNK message missing message version field\n" );
       return -1;
    }

    //
    // chunk offset
    //
    cb_item = cn_cbor_mapget_string( in_cb, "O" );
    if( cb_item )
    {
       out_sft_file_chunk->offset = cb_item->v.uint;
    }
    else
    {
        printf("FILE_CHUNK message missing offset field\n");
        return -1;
    }

    //
    // chunk length
    //
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing length field\n" );
        return -1;
    }

    //
    // Status
    //
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        printf( "FILE_CHUNK message missing status field\n" );
        return -1;
    }

    //
    // Byte Array
    //
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if(cb_item)
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array = (unsigned char *)cb_item->v.str;
    }
    else
    {
        printf( "FILE_CHUNK message missing byte array field\n" );
    }

    return 0;
}

void xi_publish_file_chunk_request( xi_context_handle_t in_context_handle, const char* file_name, const char* file_revision, int offset )
{
    const int message_type = XI_FILE_GET_CHUNK;
    const int message_version = 1;
    const int chunk_length = 1024;

#if 0
    printf( "File chunk request params:\n" );
    printf( "N: \"%s\"\n", message_length );
    printf( "R: \"%s\"\n", file_revision );
    printf( "O: %d\n", offset );
    printf( "L: %d\n", message_length );
#endif

    /* Format a CBOR message of the FILE_GET_CHUNK message type. */
    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create(&err);

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgtype", &err ),
                     cn_cbor_int_create( message_type, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgver", &err ),
                     cn_cbor_int_create( message_version, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "N", &err ),
                     cn_cbor_string_create( file_name, &err ), &err);

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( file_revision, &err ), &err);

    cn_cbor_map_put( cb_map, cn_cbor_string_create("O", &err ),
                     cn_cbor_int_create(offset, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create("L", &err ),
                     cn_cbor_int_create(chunk_length, &err ), &err );

    unsigned char encoded_cbor_msg[128];
    ssize_t encoded_size = cn_cbor_encoder_write( encoded_cbor_msg, 0, sizeof( encoded_cbor_msg ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    xi_publish_data( in_context_handle, xi_stopic, encoded_cbor_msg, encoded_size,
                     XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );

